package com.javarush.task.task02.lesson02;

/* Сумма и произведение
В методе main обьявите две целочисельные переменные a и b типа int. Присвойте им любые значения.
Выведите на экран их сумму и произведение. Каждое значение выводить с новой строки.
Пример вывода на экран для а = 5, b = 7:
12
35
*/
public class Solution
{
    public static void main(String[] args) {
        int a = 1,b=2;
        System.out.println(a+b);
        System.out.println(a*b);
    }
}
