package com.javarush.task.task03.lesson04;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("JULY 7 1986");
    }
}