package com.javarush.task.task01.lesson03;

/* Вывод на экран переменной
Объявите переменную name типа String.
Сразу же в строке объявления присвойте ей какое-нибудь значение.
Выведите на экран переменную name.
*/
public class Solution
{
    public static void main(String[] args)
    {
        String name = "I'm Diego";
        System.out.print(name);
    }
}
