package com.javarush.task.task01.lesson03;

/* Вывод на экран нескольких переменных
Объявите переменную name типа String, переменные age, height типа int.
Сразу же в строке объявления присвойте им любые разные значения.
Выведите на экран все переменные в любом порядке. Каждую с новой строки.
*/
public class Solution
{
    public static void main(String[] args)
    {
        String name="Pots";
        int age=16, height=171;
        System.out.println(name);
        System.out.println(age);
        System.out.println(height);
    }
}
